# Уникальность селекторов: часть 1
# Мы уже упоминали, что идеальный селектор - это такой селектор, который позволяет найти только один искомый элемент на странице. Благодаря уникальным селекторам наши тесты становятся стабильнее и меньше зависят от изменений в вёрстке страницы. Небольшие изменения разработчики делают достаточно часто, а мы бы не хотели постоянно исправлять наши тесты.

# Другое важное замечание: хороший тест проверяет только маленькую, атомарную часть функциональности. Простые тесты, которые проверяют небольшой сценарий, лучше, чем один большой тест, проверяющий сразу много сценариев. Благодаря простым тестам мы быстрее локализуем место в продукте, где появился баг, а также можем найти одновременно несколько новых багов. Упавший большой автотест укажет только на первую встреченную проблему, так как он заканчивает работу при первой же найденной ошибке. В этом их отличие от ручных тестов, в которых мы проверяя функциональность продукта по тест-кейсу, можем гибко обойти встречающиеся проблемы и пройти тест-кейс до конца, найдя все баги.

# Рассмотрим следующий пример: у нас есть форма регистрации, в которой есть обязательные и необязательные поля для заполнения. Нужно проверить, что можно успешно зарегистрироваться на сайте.

# Сценарий плохого автотеста:

# 1

# Открыть страницу с формой
# Заполнить все поля
# Нажать кнопку "Регистрация"
# Проверить, что есть собщение об успешной регистрации
# Лучше разбить предыдущий тест на набор более простых автотестов:

# 1

# Открыть страницу с формой
# Заполнить только обязательные поля
# Нажать кнопку "Регистрация"
# Проверить, что есть собщение об успешной регистрации
# 2

# Открыть страницу с формой
# Заполнить все обязательные поля
# Заполнить все необязательные поля
# Нажать кнопку "Регистрация"
# Проверить, что есть собщение об успешной регистрации
# 3

# Открыть страницу с формой
# Заполнить только необязательные поля
# Проверить, что кнопка "Регистрация" неактивна