# Установка Selenium для Python
# Теперь мы почти готовы запустить браузер с помощью Python и Selenium, и выполнить в нём простые действия. Но предварительно нам еще надо установить библиотеку Selenium для Python и драйвер - программу, которая позволяет взаимодействовать с браузером при помощи selenium.

# В нашем виртуальном окружении установим библиотеку Selenium. Проверьте, что вы указали для установки именно версию 3.13.0. Проект Selenium развивается очень быстро и в других версиях могут быть расхождения в наборе методов Selenium и некоторые примеры у вас могут не работать:

# pip install selenium==3.13.0

# Проверим, что библиотека действительно установлена:

# pip list

# https://ucarecdn.com/76ebf85f-e30b-418d-8c3f-5bfcfdae7f3a/