#https://stepik.org/lesson/222929/step/1?auth=login&unit=196191
#source selenium_env/bin/activate

# О курсе
# Всем привет! 

# Мы рады приветствовать вас на нашем курсе. Мы — это Юля и Леша, команда тестирования Stepik.org. В этом курсе мы попытались рассказать минимум, необходимый для ручных тестировщиков, чтобы начать автоматизировать тесты с помощью языка программирования Python. 

# В этом курсе вы научитесь: 

# Писать простые скрипты для взаимодействия с браузером 
# Находить самые разные элементы на веб-страницах
# Работать с предупреждениями и разными окнами в автотестах 
# Настраивать разные ожидания для поиска элементов
# Работать с системой контроля версий Git (на базовом уровне)
# Использовать разные тестовые фреймворки 
# Как организовать код автотестов так, чтобы его было легко поддерживать и легко читать
# ... и еще много разных мелочей, tips and tricks, а так же хорошие практики, которые мы сами стараемся использовать!
# Курс содержит теорию в текстовом формате, но всё-таки он ориентирован именно на практику. Это настоящая "школа молодого бойца": вы напишете много строчек кода, разберете множество каверзных ситуаций и поймаете разные хитрые баги. А еще по окончании курса у вас появится небольшой тестовый проект: это финальное задание курса, за которое вы получите больше всего баллов. Этот проект можно приложить к своему резюме как демонстрацию своих умений для будущего работодателя.

# Как проходит курс? 

# Курс условно разделен на 4 модуля. Каждый модуль — это одна неделя ваших занятий. Но, вообще говоря, можете проходить в свободном темпе, удобном вам. 

# Данный курс для нас — это первый опыт преподавания, и хотя мы попытались рассказать все темы достаточно доходчиво для самой широкой аудитории, это было нелегко, учитывая какой широкий бэкграунд бывает у тестировщиков. Так что, пожалуйста, пишите ваши комментарии, мы постараемся их учесть и ответить на ваши вопросы. 

# Надеемся, это поможет сделать курс еще более полезным для всех студентов! 

# Содержание урока:

# Как проходят занятия 
# Пример задания: тесты с выбором ответа
# Комментарии
# Задание: что такое Selenium?
# Что такое Selenium?
# Что такое Selenium WebDriver? 
# Задание: терминология
# Задание: инфраструктура проекта Selenium
# Задание: инфраструктура проекта Selenium (продолжение)

# Что такое Selenium? 
# У термина довольно много разных значений, и много всего под ним подразумевают в разных контекстах. 

# Давайте разберемся и разложим все по полочкам! 

# Для начала: Selenium — это проект, который предназначен главным образом для автоматизации тестирования веб-приложений. Проект кстати, open-source, то есть с открытым исходным кодом. В любой момент можно заглянуть внутрь кода и посмотреть, как работает тот или иной метод, а также можно написать свои предложения разработчикам проекта, и, более того, сделать pull request с исправлениями и улучшениями кода.

# Это собирательный, зонтичный проект, то есть он состоит из множества самых разных компонентов, например: 

# Selenium WebDriver
# Selenium Grid
# Selenium Server
# Selenium IDE
# и не только...
# А также проект содержит ряд конкретных драйверов браузера и клиентских библиотек для разных языков программирования.

# Обычно из контекста понятно, о какой из частей Selenium идет речь. В данном курсе речь пойдет о Selenium WebDriver, и всякий раз, когда мы будем говорить Selenium, будем иметь в виду именно эту часть проекта. А подробнее в том, что это такое, мы разберемся на следующем шаге.


# Что такое Selenium WebDriver? 
# Автотесты бывают очень разными, проверяют разные вещи и работают для разных уровней приложения. Наверняка вы не раз видели так называемую "пирамиду тестирования". В нашем курсе мы в основном будем говорить про end-to-end тесты, то есть такие, которые проверяют полную работу системы и имитируют действия пользователя. 

# Что нам нужно для того, чтобы написать такой тест для веб-приложения? 

# Очевидно, код на языке программирования. Там будут содержаться какая-то логика действий (например: залогинить пользователя, добавить товар в корзину) и проверки.
# Браузер, чтобы имитировать действия пользователя. Желательно, какой-нибудь популярный. А еще лучше — несколько. 
# Эти две части нужно как-то связать воедино. И как раз для этого нужен Selenium WebDriver. По сути своей это — универсальный интерфейс, который позволяет манипулировать разными браузерами напрямую из кода на языке программирования. Его крутость как раз в его универсальности: за некоторыми исключениями, все наши тесты, написанные один раз, можно запускать для разных браузеров.

# Верна универсальность и в другую сторону: браузер будет выполнять одинаковые действия, не важно из библиотеки какого именно языка программирования эти методы будут вызваны. Вообще-то, Selenium WebDriver поддерживает довольно много языков программирования, хотя наибольшей популярностью в индустрии пользуются Java и Python.

# В этом курсе мы будем изучать именно Selenium WebDriver, и в текстах будем использовать термин WebDriver. Однако, если вы будете искать в интернете какую-то информацию, связанную с Selenium WebDriver, то скорее всего увидите, что используется более общий термин Selenium. Вам нужно будет смотреть на контекст, чтобы определить, какая часть проекта Selenium имеется в виду.

# Итого получаем вот такую картинку:

 



# Это такое отношение "многие ко многим".

# Что здесь еще важно? Так как все браузеры работают слегка по-разному, разработчики браузеров самостоятельно реализуют "драйвер" - программу, которая позволяет интерфейсу Selenium манипулировать кнопками, текстами, элементами и т.д. 

 

# В этом курсе мы будем работать со следующим набором инструментов: 



# Интересный факт! WebDriver стал настолько популярен, что его признали стандартом протокола взаимодействия с браузером.

# Подробнее можно почитать посты Алексея Баранцева: они хоть и старые, все еще хорошие. Он сейчас - один из тех разработчиков, кто вносит вклад в проект Selenium.

# Что такое Selenium?

# Что такое Selenium WebDriver?