# Что представляет собой веб-страница?
# В данном уроке мы подробнее разберёмся с самой важной для нас возможностью Selenium WebDriver - умению взаимодействовать с элементами веб-страницы. Любая страница в интернете представляет собой html-файл, в котором с помощью языка разметки HTML описана её структура.

# Еще практически все сайты используют язык JavaScript, который позволяет сделать веб-страницу интерактивной, т.е. реагировать на действия пользователя, запрашивать у пользователя данные и возвращать их. WebDriver тоже позволяет выполнять javascript-команды в браузере, но это требуется не очень часто, поэтому мы рассмотрим эту возможность в дальнейших уроках.

# Для полноты картины нужно упомянуть еще CSS (Cascading Style Sheets — каскадные таблицы стилей), который используется для вёрстки (для красивого оформления страниц). Наверное, вы уже сталкивались с тем, что поломанная вёрстка страниц может приводить к очень неприятным багам на сайте. Благодаря WebDriver мы также можем поймать какую-то неожиданную проблему в оформлении - например, когда нужная пользователю кнопка оказывается перекрыта второстепенным элементом.

# Сейчас нас будет интересовать в первую очередь структура страницы, т.е. ее описание на языке HTML. Умея описывать путь к элементу на странице, мы можем найти такой элемент и выполнить с ним необходимые действия, например, отправить текст в текстовое поле или нажать на правильную кнопку.

# Далее мы рассмотрим несколько способов поиска элементов внутри страницы:

# Поиск с помощью CSS-селекторов, когда путь к элементу описывается через синтаксис CSS. Селектор - это описание пути к элементу на странице.
# Поиск с помощью указания частей элементов: ID, class, tag и т.д.
# Поиск с помощью языка запросов XPath.
# Поиск с помощью CSS-селекторов, с нашей точки зрения, является наиболее удобным способом, т.к. он покрывает практически все возможные ситуации, и CSS-селекторы выглядят более читабельными. В реальности в разных случаях может понадобиться использовать и другие методы поиска.