Задание: проверьте решения других учащихся
Здесь вы сможете похвастаться перед своим сокурсниками, как вы освоили работу с Git. Это задача с рецензированием. Чтобы получить баллы за это задание, необходимо проверить решения других учащихся.

В этом задании вам нужно будет отправить ссылку на ваш репозиторий в качестве ответа на это задание.

Прежде чем отправлять решение на рецензию, убедитесь, что: 

Ссылка корректная - по ней открывается реальный репозиторий.
В репозитории есть описание в файле readme.
﻿В репозитории есть хотя бы одна задача из предыдущего модуля.
Сообщение коммита осмысленное: оно описывает изменения, которые сделал человек. Здесь не нужно строго придираться к грамматике или написанию. 
Пример хороших сообщений:  

"added readme"
"initial commit"
"simple test case added"
"homework from previous module"
Пример плохих сообщений:

"commit message"
"commit1"
"asdasdads"
"something"
Чтобы получить баллы за эту задачу, вам необходимо выполнить следующие шаги:

Отправьте верную ссылку (убедитесь, что отправленное решение отмечено как правильное)
Воспользуйтесь кнопкой "Отправить это решение на рецензию". Внимание! Отправить решение на рецензию можно только один раз!
Проверьте решения минимум трех других учащихся
Дождитесь, пока ваше решение тоже проверят




Кто использует фаерфокс, для того чтобы скопировать ссылку можно вбить в консоли разработчика 

$('.textarea')[0].value