Мануал и полезные команды
В этом шаге мы рассмотрим несколько полезных команд, которые вам могут пригодиться при работе c Git.

Для начала посмотрим, что Git умеет. Введите в консоль ключевое слово git, чтобы увидеть популярные команды:

https://ucarecdn.com/0ba01dfc-aa9b-4c9c-86b0-3956ced6d552/

Если вы хотите посмотреть подсказку по какой-то конкретной команде, то можете ввести git help <команда> или git <команда> --help. Вы увидите подробную документацию по этой команде из руководства пользователя. Мануал, как и поисковик, — ваш лучший друг, не пренебрегайте его помощью.

Обратите внимание на две команды: status и log.

Попробуйте запустить команду git status и посмотрите на вывод. Данная команда позволяет отслеживать, какие изменения в репозитории вы сделали, что добавили в отслеживаемые файлы, что попало в коммит, что нет и так далее. Словом, это полезная команда, которая позволяет понимать, что происходит.

Попробуйте самостоятельно открыть мануал для команды git add. Скопируйте cтроку, которая выводится сразу за словом NAME. Введите скопированную строку в качестве ответа на данное задание.